; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=6, packages=14, locations=14, max_capacity=2, out_folder=training/easy, instance_id=81, seed=122

(define (problem transport-81)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity v5 c1)
    (capacity v6 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l14)
    (at p2 l11)
    (at p3 l12)
    (at p4 l10)
    (at p5 l3)
    (at p6 l2)
    (at p7 l5)
    (at p8 l8)
    (at p9 l12)
    (at p10 l4)
    (at p11 l9)
    (at p12 l7)
    (at p13 l7)
    (at p14 l12)
    (at v1 l11)
    (at v2 l3)
    (at v3 l13)
    (at v4 l6)
    (at v5 l5)
    (at v6 l13)
    (road l3 l4)
    (road l4 l3)
    (road l3 l1)
    (road l14 l7)
    (road l3 l10)
    (road l5 l1)
    (road l14 l10)
    (road l9 l5)
    (road l10 l3)
    (road l8 l12)
    (road l1 l3)
    (road l12 l3)
    (road l3 l6)
    (road l3 l12)
    (road l5 l9)
    (road l4 l11)
    (road l11 l4)
    (road l1 l5)
    (road l10 l14)
    (road l6 l13)
    (road l3 l2)
    (road l12 l8)
    (road l2 l3)
    (road l13 l6)
    (road l6 l3)
    (road l7 l14)
    (road l1 l8)
    (road l8 l1)
    )
 (:goal  (and 
    (at p1 l13)
    (at p2 l6)
    (at p3 l14)
    (at p4 l11)
    (at p5 l2)
    (at p6 l5)
    (at p7 l9)
    (at p8 l2)
    (at p9 l11)
    (at p10 l11)
    (at p11 l2)
    (at p12 l8)
    (at p13 l5)
    (at p14 l4))))

; plan
1. (drive v1 l11 l4)
   deleted: (at v1 l11)
   added: (at v1 l4)
   goals met: 0 of 14
2. (drive v1 l4 l3)
   deleted: (at v1 l4)
   added: (at v1 l3)
   goals met: 0 of 14
3. (drive v1 l3 l10)
   deleted: (at v1 l3)
   added: (at v1 l10)
   goals met: 0 of 14
4. (drive v1 l10 l14)
   deleted: (at v1 l10)
   added: (at v1 l14)
   goals met: 0 of 14
5. (pick-up v1 l14 p1 c0 c1)
   deleted: (at p1 l14) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 14
6. (drive v1 l14 l10)
   deleted: (at v1 l14)
   added: (at v1 l10)
   goals met: 0 of 14
7. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 0 of 14
8. (drive v1 l3 l6)
   deleted: (at v1 l3)
   added: (at v1 l6)
   goals met: 0 of 14
9. (drive v1 l6 l13)
   deleted: (at v1 l6)
   added: (at v1 l13)
   goals met: 0 of 14
10. (drop v1 l13 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l13) (capacity v1 c1)
   goals met: 1 of 14
11. (drive v1 l13 l6)
   deleted: (at v1 l13)
   added: (at v1 l6)
   goals met: 1 of 14
12. (drive v1 l6 l3)
   deleted: (at v1 l6)
   added: (at v1 l3)
   goals met: 1 of 14
13. (drive v1 l3 l4)
   deleted: (at v1 l3)
   added: (at v1 l4)
   goals met: 1 of 14
14. (drive v1 l4 l11)
   deleted: (at v1 l4)
   added: (at v1 l11)
   goals met: 1 of 14
15. (pick-up v1 l11 p2 c0 c1)
   deleted: (at p2 l11) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 1 of 14
16. (drive v1 l11 l4)
   deleted: (at v1 l11)
   added: (at v1 l4)
   goals met: 1 of 14
17. (drive v1 l4 l3)
   deleted: (at v1 l4)
   added: (at v1 l3)
   goals met: 1 of 14
18. (drive v1 l3 l6)
   deleted: (at v1 l3)
   added: (at v1 l6)
   goals met: 1 of 14
19. (drop v1 l6 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l6) (capacity v1 c1)
   goals met: 2 of 14
20. (drive v1 l6 l3)
   deleted: (at v1 l6)
   added: (at v1 l3)
   goals met: 2 of 14
21. (drive v1 l3 l12)
   deleted: (at v1 l3)
   added: (at v1 l12)
   goals met: 2 of 14
22. (pick-up v1 l12 p3 c0 c1)
   deleted: (at p3 l12) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 14
23. (drive v1 l12 l3)
   deleted: (at v1 l12)
   added: (at v1 l3)
   goals met: 2 of 14
24. (drive v1 l3 l10)
   deleted: (at v1 l3)
   added: (at v1 l10)
   goals met: 2 of 14
25. (drive v1 l10 l14)
   deleted: (at v1 l10)
   added: (at v1 l14)
   goals met: 2 of 14
26. (drop v1 l14 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l14) (capacity v1 c1)
   goals met: 3 of 14
27. (drive v1 l14 l10)
   deleted: (at v1 l14)
   added: (at v1 l10)
   goals met: 3 of 14
28. (pick-up v1 l10 p4 c0 c1)
   deleted: (at p4 l10) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 14
29. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 3 of 14
30. (drive v1 l3 l4)
   deleted: (at v1 l3)
   added: (at v1 l4)
   goals met: 3 of 14
31. (drive v1 l4 l11)
   deleted: (at v1 l4)
   added: (at v1 l11)
   goals met: 3 of 14
32. (drop v1 l11 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l11) (capacity v1 c1)
   goals met: 4 of 14
33. (drive v1 l11 l4)
   deleted: (at v1 l11)
   added: (at v1 l4)
   goals met: 4 of 14
34. (drive v1 l4 l3)
   deleted: (at v1 l4)
   added: (at v1 l3)
   goals met: 4 of 14
35. (pick-up v1 l3 p5 c0 c1)
   deleted: (at p5 l3) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 4 of 14
36. (drive v1 l3 l2)
   deleted: (at v1 l3)
   added: (at v1 l2)
   goals met: 4 of 14
37. (drop v1 l2 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l2) (capacity v1 c1)
   goals met: 5 of 14
38. (pick-up v1 l2 p6 c0 c1)
   deleted: (at p6 l2) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 14
39. (drive v1 l2 l3)
   deleted: (at v1 l2)
   added: (at v1 l3)
   goals met: 5 of 14
40. (drive v1 l3 l1)
   deleted: (at v1 l3)
   added: (at v1 l1)
   goals met: 5 of 14
41. (drive v1 l1 l5)
   deleted: (at v1 l1)
   added: (at v1 l5)
   goals met: 5 of 14
42. (drop v1 l5 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l5) (capacity v1 c1)
   goals met: 6 of 14
43. (pick-up v1 l5 p7 c0 c1)
   deleted: (at p7 l5) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 14
44. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 6 of 14
45. (drop v1 l9 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l9) (capacity v1 c1)
   goals met: 7 of 14
46. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 7 of 14
47. (drive v1 l5 l1)
   deleted: (at v1 l5)
   added: (at v1 l1)
   goals met: 7 of 14
48. (drive v1 l1 l8)
   deleted: (at v1 l1)
   added: (at v1 l8)
   goals met: 7 of 14
49. (pick-up v1 l8 p8 c0 c1)
   deleted: (at p8 l8) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 7 of 14
50. (drive v1 l8 l12)
   deleted: (at v1 l8)
   added: (at v1 l12)
   goals met: 7 of 14
51. (drive v1 l12 l3)
   deleted: (at v1 l12)
   added: (at v1 l3)
   goals met: 7 of 14
52. (drive v1 l3 l2)
   deleted: (at v1 l3)
   added: (at v1 l2)
   goals met: 7 of 14
53. (drop v1 l2 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l2) (capacity v1 c1)
   goals met: 8 of 14
54. (drive v1 l2 l3)
   deleted: (at v1 l2)
   added: (at v1 l3)
   goals met: 8 of 14
55. (drive v1 l3 l12)
   deleted: (at v1 l3)
   added: (at v1 l12)
   goals met: 8 of 14
56. (pick-up v1 l12 p9 c0 c1)
   deleted: (at p9 l12) (capacity v1 c1)
   added: (in p9 v1) (capacity v1 c0)
   goals met: 8 of 14
57. (drive v1 l12 l3)
   deleted: (at v1 l12)
   added: (at v1 l3)
   goals met: 8 of 14
58. (drive v1 l3 l4)
   deleted: (at v1 l3)
   added: (at v1 l4)
   goals met: 8 of 14
59. (drive v1 l4 l11)
   deleted: (at v1 l4)
   added: (at v1 l11)
   goals met: 8 of 14
60. (drop v1 l11 p9 c0 c1)
   deleted: (in p9 v1) (capacity v1 c0)
   added: (at p9 l11) (capacity v1 c1)
   goals met: 9 of 14
61. (drive v1 l11 l4)
   deleted: (at v1 l11)
   added: (at v1 l4)
   goals met: 9 of 14
62. (pick-up v1 l4 p10 c0 c1)
   deleted: (at p10 l4) (capacity v1 c1)
   added: (in p10 v1) (capacity v1 c0)
   goals met: 9 of 14
63. (drive v1 l4 l11)
   deleted: (at v1 l4)
   added: (at v1 l11)
   goals met: 9 of 14
64. (drop v1 l11 p10 c0 c1)
   deleted: (in p10 v1) (capacity v1 c0)
   added: (at p10 l11) (capacity v1 c1)
   goals met: 10 of 14
65. (drive v1 l11 l4)
   deleted: (at v1 l11)
   added: (at v1 l4)
   goals met: 10 of 14
66. (drive v1 l4 l3)
   deleted: (at v1 l4)
   added: (at v1 l3)
   goals met: 10 of 14
67. (drive v1 l3 l1)
   deleted: (at v1 l3)
   added: (at v1 l1)
   goals met: 10 of 14
68. (drive v1 l1 l5)
   deleted: (at v1 l1)
   added: (at v1 l5)
   goals met: 10 of 14
69. (drive v1 l5 l9)
   deleted: (at v1 l5)
   added: (at v1 l9)
   goals met: 10 of 14
70. (pick-up v1 l9 p11 c0 c1)
   deleted: (at p11 l9) (capacity v1 c1)
   added: (in p11 v1) (capacity v1 c0)
   goals met: 10 of 14
71. (drive v1 l9 l5)
   deleted: (at v1 l9)
   added: (at v1 l5)
   goals met: 10 of 14
72. (drive v1 l5 l1)
   deleted: (at v1 l5)
   added: (at v1 l1)
   goals met: 10 of 14
73. (drive v1 l1 l3)
   deleted: (at v1 l1)
   added: (at v1 l3)
   goals met: 10 of 14
74. (drive v1 l3 l2)
   deleted: (at v1 l3)
   added: (at v1 l2)
   goals met: 10 of 14
75. (drop v1 l2 p11 c0 c1)
   deleted: (in p11 v1) (capacity v1 c0)
   added: (at p11 l2) (capacity v1 c1)
   goals met: 11 of 14
76. (drive v1 l2 l3)
   deleted: (at v1 l2)
   added: (at v1 l3)
   goals met: 11 of 14
77. (drive v1 l3 l10)
   deleted: (at v1 l3)
   added: (at v1 l10)
   goals met: 11 of 14
78. (drive v1 l10 l14)
   deleted: (at v1 l10)
   added: (at v1 l14)
   goals met: 11 of 14
79. (drive v1 l14 l7)
   deleted: (at v1 l14)
   added: (at v1 l7)
   goals met: 11 of 14
80. (pick-up v1 l7 p12 c0 c1)
   deleted: (at p12 l7) (capacity v1 c1)
   added: (in p12 v1) (capacity v1 c0)
   goals met: 11 of 14
81. (drive v1 l7 l14)
   deleted: (at v1 l7)
   added: (at v1 l14)
   goals met: 11 of 14
82. (drive v1 l14 l10)
   deleted: (at v1 l14)
   added: (at v1 l10)
   goals met: 11 of 14
83. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 11 of 14
84. (drive v1 l3 l1)
   deleted: (at v1 l3)
   added: (at v1 l1)
   goals met: 11 of 14
85. (drive v1 l1 l8)
   deleted: (at v1 l1)
   added: (at v1 l8)
   goals met: 11 of 14
86. (drop v1 l8 p12 c0 c1)
   deleted: (in p12 v1) (capacity v1 c0)
   added: (at p12 l8) (capacity v1 c1)
   goals met: 12 of 14
87. (drive v1 l8 l12)
   deleted: (at v1 l8)
   added: (at v1 l12)
   goals met: 12 of 14
88. (drive v1 l12 l3)
   deleted: (at v1 l12)
   added: (at v1 l3)
   goals met: 12 of 14
89. (drive v1 l3 l10)
   deleted: (at v1 l3)
   added: (at v1 l10)
   goals met: 12 of 14
90. (drive v1 l10 l14)
   deleted: (at v1 l10)
   added: (at v1 l14)
   goals met: 12 of 14
91. (drive v1 l14 l7)
   deleted: (at v1 l14)
   added: (at v1 l7)
   goals met: 12 of 14
92. (pick-up v1 l7 p13 c0 c1)
   deleted: (at p13 l7) (capacity v1 c1)
   added: (in p13 v1) (capacity v1 c0)
   goals met: 12 of 14
93. (drive v1 l7 l14)
   deleted: (at v1 l7)
   added: (at v1 l14)
   goals met: 12 of 14
94. (drive v1 l14 l10)
   deleted: (at v1 l14)
   added: (at v1 l10)
   goals met: 12 of 14
95. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 12 of 14
96. (drive v1 l3 l1)
   deleted: (at v1 l3)
   added: (at v1 l1)
   goals met: 12 of 14
97. (drive v1 l1 l5)
   deleted: (at v1 l1)
   added: (at v1 l5)
   goals met: 12 of 14
98. (drop v1 l5 p13 c0 c1)
   deleted: (in p13 v1) (capacity v1 c0)
   added: (at p13 l5) (capacity v1 c1)
   goals met: 13 of 14
99. (drive v1 l5 l1)
   deleted: (at v1 l5)
   added: (at v1 l1)
   goals met: 13 of 14
100. (drive v1 l1 l3)
   deleted: (at v1 l1)
   added: (at v1 l3)
   goals met: 13 of 14
101. (drive v1 l3 l12)
   deleted: (at v1 l3)
   added: (at v1 l12)
   goals met: 13 of 14
102. (pick-up v1 l12 p14 c0 c1)
   deleted: (at p14 l12) (capacity v1 c1)
   added: (in p14 v1) (capacity v1 c0)
   goals met: 13 of 14
103. (drive v1 l12 l3)
   deleted: (at v1 l12)
   added: (at v1 l3)
   goals met: 13 of 14
104. (drive v1 l3 l4)
   deleted: (at v1 l3)
   added: (at v1 l4)
   goals met: 13 of 14
105. (drop v1 l4 p14 c0 c1)
   deleted: (in p14 v1) (capacity v1 c0)
   added: (at p14 l4) (capacity v1 c1)
   goals met: 14 of 14
